//=================================================================
// [GameManager.cpp] ゲームマネージャーモジュール 
// 著者：有馬啓太
//-----------------------------------------------------------------
// 説明：ゲームの状態とオブジェクトの管理、追加と削除、入力、更新、描画など
//=================================================================

/*----- インクルード -----*/
#include <iostream>
#include <format>
#include <algorithm>
#include <vector>
#include <iterator>
#include <memory>

#include "GameManager.h"
#include "Renderer.h"
#include "Scene/SceneManager.h"
#include "TextureManager.h"

//-----------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------
GameManager::GameManager()
{
	scene_manager_ = std::make_unique<SceneManager>(this);
	renderer_ = std::make_unique<Renderer>();

	this->InitAll();
}

//-----------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------
GameManager::~GameManager(void)
{
	this->UninitAll();
}

//-----------------------------------------------------------------
// 初期化処理
//-----------------------------------------------------------------
void GameManager::InitAll(void)
{

	// レンダラー初期化
	renderer_->Init();

	// テクスチャのロード
	TextureManager::GetInstance().Init();

	// シーンマネージャの初期化
	scene_manager_->Init();


}

//-----------------------------------------------------------------
// 終了処理
//-----------------------------------------------------------------
void GameManager::UninitAll(void)
{

}

//-----------------------------------------------------------------
// 更新処理
//-----------------------------------------------------------------
void GameManager::UpdateAll()
{
	// シーンのアップデート
	scene_manager_->Update();
}

//-----------------------------------------------------------------
// 出力生成処理
//-----------------------------------------------------------------
void GameManager::GenerateOutputAll(void)
{
	if (renderer_)
	{

		renderer_->Begin();
		renderer_->Draw();
		renderer_->End();

	}
}
